jmeter/optimized-report/statistics.json
{
  "chatflow-v4-tg-854980745.us-west-2.elb.amazonaws.com" : {
    "transaction" : "chatflow-v4-tg-854980745.us-west-2.elb.amazonaws.com",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 114.8465999999997,
    "medianResTime" : 75.0,
    "minResTime" : 31.0,
    "maxResTime" : 19136.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 170.0,
    "pct3ResTime" : 223.98999999999978,
    "throughput" : 108.93364851468971,
    "receivedKBytesPerSec" : 15.637935870761119,
    "sentKBytesPerSec" : 17.824832054951578
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 131358,
    "errorCount" : 111358,
    "errorPct" : 84.77444,
    "meanResTime" : 692.2294721295996,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 75117.0,
    "pct1ResTime" : 110.0,
    "pct2ResTime" : 75001.0,
    "pct3ResTime" : 75003.0,
    "throughput" : 7.394459102573978E-5,
    "receivedKBytesPerSec" : 2.8658919461033543E-6,
    "sentKBytesPerSec" : 1.0915302747069256E-6
  },
  "JOIN" : {
    "transaction" : "JOIN",
    "sampleCount" : 10000,
    "errorCount" : 10000,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : "Infinity",
    "receivedKBytesPerSec" : "NaN",
    "sentKBytesPerSec" : "NaN"
  },
  "TEXT" : {
    "transaction" : "TEXT",
    "sampleCount" : 100000,
    "errorCount" : 100000,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : "Infinity",
    "receivedKBytesPerSec" : "NaN",
    "sentKBytesPerSec" : "NaN"
  },
  "WebSocket Close" : {
    "transaction" : "WebSocket Close",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.32159999999993,
    "medianResTime" : 32.0,
    "minResTime" : 13.0,
    "maxResTime" : 314.0,
    "pct1ResTime" : 110.0,
    "pct2ResTime" : 118.0,
    "pct3ResTime" : 129.0,
    "throughput" : 108.96569759839603,
    "receivedKBytesPerSec" : 2.8731189796452075,
    "sentKBytesPerSec" : 3.298766235888942
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 1358,
    "errorCount" : 1358,
    "errorPct" : 100.0,
    "meanResTime" : 65779.23195876287,
    "medianResTime" : 75002.0,
    "minResTime" : 4.0,
    "maxResTime" : 75117.0,
    "pct1ResTime" : 75003.0,
    "pct2ResTime" : 75004.0,
    "pct3ResTime" : 75008.0,
    "throughput" : 2.6053257616453074,
    "receivedKBytesPerSec" : 6.50729285573824,
    "sentKBytesPerSec" : 0.0
  }
}